{
  "classic": {
    "tier1": [
      "Two losses? Your dick's so small it needs a step-ladder to ride a coin.",
      "Three in a row? Even your participation trophies are embarrassed.",
      "Two tails and you're already crying? Your ex was right about you.",
      "Three losses? That's not gambling, that's a personality disorder.",
      "Two flips, two fails. Like your dating life, but faster.",
      "Three straight tails? Your hairline retreats faster than this.",
      "Two losses in? Your mom's boyfriend has more game than you.",
      "Three tails? Even Nigerian princes won't email you anymore.",
      "Two losses? Your bank account has seen worse, but barely.",
      "Three in a row? Your high school bully is laughing somewhere.",
      "Two tails? That's the same number of friends you have left.",
      "Three losses? Your dog pretends to be asleep when you come home.",
      "Two flips, two fails. Your Tinder matches are higher odds.",
      "Three tails? Your ex's new boyfriend is richer AND taller.",
      "Two losses in and you're still here? That's the spirit of a born loser.",
      "Three straight fails? Your credit score just dropped in sympathy.",
      "Two tails? That's more action than you've seen in years.",
      "Three losses? Even Blockbuster had a longer winning streak.",
      "Two flips down? Your portfolio wishes it performed this bad.",
      "Three tails in a row? Your barber has given up on you too."
    ],
    "tier2": [
      "Four losses? Your ancestors are doing backflips in their graves.",
      "Five straight tails? Even your therapist is taking notes now.",
      "Six in a row? This is performance art at this point.",
      "Four losses and counting? Your high school girlfriend had higher standards.",
      "Five tails? Your gym membership has seen more action than you.",
      "Six straight losses? NASA wants to study your gravitational pull toward failure.",
      "Four in a row? Your Plants vs Zombies garden is more strategic than this.",
      "Five losses? Even your spam folder is more successful than you.",
      "Six tails straight? Your WiFi password is more secure than your winning chances.",
      "Four losses? That's cute. Your divorce lawyer had better odds.",
      "Five in a row? Your microwave meal has more heat than your streak.",
      "Six straight fails? Even your phone's autocorrect has given up on you.",
      "Four tails? Your last relationship lasted longer than this winning streak.",
      "Five losses? Your houseplants have a better survival rate.",
      "Six in a row? Even participation trophies require some effort, champ.",
      "Four straight tails? Your 401k is cringing in sympathy.",
      "Five losses and still going? That's the spirit of a Blockbuster investor.",
      "Six tails? Your browser history is less embarrassing than this.",
      "Four in a row? Even your autocorrect stopped trying to help.",
      "Five straight losses? Your fortune cookie said 'Maybe next life.'"
    ],
    "tier3": [
      "Seven losses? You magnificent disaster, this is legendary failure.",
      "Eight straight tails? Even your shadow is considering leaving.",
      "Nine in a row? Blockbuster employees are standing and clapping.",
      "Ten losses? You're not gambling, you're funding my retirement.",
      "Eleven straight? NASA called, they want to study your orbit around defeat.",
      "Twelve tails? Your ex just sent a 'Told you so' text telepathically.",
      "Seven in a row? This is the content your therapist LIVES for.",
      "Eight losses? Even Nigerian princes are blocking your emails now.",
      "Nine straight tails? Your participation trophy just filed for divorce.",
      "Ten in a row? This is going in your obituary under 'Achievements.'",
      "Eleven losses? Your fortune cookie just said 'LMAOOOOO.'",
      "Twelve straight? Even your mom's boyfriend is impressed by this failure.",
      "Seven tails? This is the most consistent thing you've ever done.",
      "Eight in a row? Your Tamagotchi had a better survival rate.",
      "Nine losses? Congratulations, you're now a tax write-off.",
      "Ten straight tails? Your high school guidance counselor saw this coming.",
      "Eleven in a row? Even Siri is judging you right now.",
      "Twelve losses? This is the plot of a really depressing Netflix documentary.",
      "Seven straight? Your WiFi router has more wins than you this week.",
      "Eight tails in a row? Even your spam folder is more successful."
    ],
    "tier4": [
      "Fifteen losses? Bro, you're not gambling, you're performance art.",
      "Eighteen straight? This is the stuff of legend and restraining orders.",
      "Twenty tails? You've transcended gambling, you're a philosopher of failure.",
      "Twenty-five in a row? Your therapist just upgraded their yacht.",
      "Thirty losses? This is no longer a streak, it's a lifestyle choice.",
      "Thirteen straight? Museums will preserve this moment in amber.",
      "Sixteen tails? Your biography will be required reading in economics classes.",
      "Nineteen in a row? This is the most impressive thing you've ever done, no cap.",
      "Twenty-two losses? Even your demons are rooting for you now.",
      "Twenty-seven straight? This transcends failure, this is ART.",
      "Fourteen in a row? Historians will argue about your methodology for centuries.",
      "Seventeen tails? You've achieved what scholars call 'terminal velocity of suck.'",
      "Twenty straight? This is the kind of consistency CEOs dream about.",
      "Twenty-three losses? Your parents' disappointment has evolved into respect.",
      "Twenty-eight in a row? You're not a degenerate, you're a degenerATE.",
      "Fifteen straight tails? This is going in the Louvre next to the Mona Lisa.",
      "Eighteen losses? Even your bad luck is having an identity crisis now.",
      "Twenty-one in a row? This is the redemption arc nobody asked for.",
      "Twenty-four straight? You've weaponized failure and it's beautiful.",
      "Twenty-nine tails? You're one loss away from enlightenment, king."
    ],
    "tier5": [
      "Thirty-one straight losses? You are the final boss of sucking. Mint this immediately.",
      "Thirty-five tails? Scientists want to study your DNA for failure genes.",
      "Forty in a row? This is no longer gambling, this is your autobiography.",
      "Forty-five straight? You've achieved what legends only dream of: pure, uncut failure.",
      "Fifty losses? The universe is trying to tell you something, and it's applauding.",
      "Thirty-two in a row? You didn't just break records, you cremated them.",
      "Thirty-seven straight? This is the most consistent relationship you've ever had.",
      "Forty-two tails? The answer to life, the universe, and you being a magnificent loser.",
      "Forty-eight in a row? Even your FBI agent closed the surveillance window in respect.",
      "Fifty-five straight? This isn't a streak, this is a philosophical statement.",
      "Thirty-three losses? Trinity numbers mean you're blessed by the holy spirit of failure.",
      "Thirty-nine in a row? You're not mortal anymore, you're a legend carved in shame.",
      "Forty-four straight? Even your reflection in the mirror gave you a standing ovation.",
      "Fifty-one tails? This is the stuff they'll teach in business schools as 'what not to do.'",
      "Sixty losses? You've transcended humanity. You're a god of failure and we worship you.",
      "Thirty-four straight? This is going in your Tinder bio and you're getting matches.",
      "Forty-one in a row? Your obituary just wrote itself and it's FIRE.",
      "Forty-seven straight? This level of dedication deserves a TED Talk.",
      "Fifty-three tails? You're not a person anymore, you're a case study.",
      "Sixty-five straight? The simulation broke trying to process your L-taking ability."
    ]
  },
"degenerate": {
    "tier1": [
      "Two losses? Your hairline's retreating faster than your winning chances.",
      "Three tails? Even your mirror started charging you rent for looking at it.",
      "Two losses in? Your credit score just filed a restraining order against you.",
      "Three straight? That stripper's had more successful spins than your entire year.",
      "Two tails? Your ex's new boyfriend just bought a boat. You bought gas station sushi.",
      "Three losses? Your gym membership expired in 2019 and nobody noticed.",
      "Two flips, two fails. Even your spam folder has higher standards.",
      "Three in a row? Your LinkedIn profile says 'CEO' but we all know it's 'Unemployed.'",
      "Two losses? That's how many times your barber tried before giving up on you.",
      "Three straight tails? Your therapist started therapy because of you.",
      "Two tails in? Your Tinder bio says 'entrepreneur.' We all know you're broke.",
      "Three losses? Even your houseplants fake being dead when you walk in.",
      "Two flips down? Your portfolio's down 80% but at least that's consistent with this.",
      "Three in a row? Your high school bully just became a millionaire. You became THIS.",
      "Two losses? Even truck stop vending machines have rejected your credit card.",
      "Three straight fails? Your parents tell people you're 'finding yourself.' You're just lost.",
      "Two tails? That's how many friends showed up to your birthday. One was your mom.",
      "Three losses? Your Uber driver gave you three stars. You gave HIM five.",
      "Two in a row? Even your autocorrect has given up trying to save you.",
      "Three straight tails? That belly's arriving five minutes before you do everywhere."
    ],
    "tier2": [
      "Four losses? Your receding hairline just bought a one-way ticket to Bald Town.",
      "Five straight tails? Even that stripper's rotating away from your life choices.",
      "Six in a row? You're built like a traffic cone and dress like one too.",
      "Four losses and still here? Your bank account has more red flags than a Communist parade.",
      "Five tails? You look like you clip coupons for gas station hotdogs. And you do.",
      "Six straight? That gut's so big it has its own zip code and voting rights.",
      "Four in a row? You're so bald your head looks like a freshly waxed bowling ball.",
      "Five losses? Even fortune cookies started putting disclaimers about you inside.",
      "Six straight tails? Your dating profile says 'athletic build.' Your mirror disagrees.",
      "Four losses? You dress like a divorced dad at a waterpark. Every. Single. Day.",
      "Five in a row? That double chin's got its own LinkedIn profile and better connections.",
      "Six straight fails? You're so cheap you bring Tupperware to all-you-can-eat buffets.",
      "Four tails? Your car's check engine light has been on since Obama's first term.",
      "Five losses? Even Nigerian princes stopped emailing you. Too risky.",
      "Six in a row? That beer gut's bigger than your hopes, dreams, AND ambitions combined.",
      "Four straight? You look like you haven't seen a gym since high school PE. In 2003.",
      "Five losses and counting? Your therapist just prescribed therapy for themselves.",
      "Six tails straight? That receding hairline and advancing gut are racing to see what quits first.",
      "Four in a row? You're shaped like a melted candle that gave up halfway through.",
      "Five straight fails? Even your participation trophies requested to be reassigned."
    ],
    "tier3": [
      "Seven losses? You're built like a potato and dress like a scarecrow.",
      "Eight straight? That gut's so big it arrives at parties 20 minutes before you do.",
      "Nine in a row? Your hairline's running from your face faster than your creditors.",
      "Ten losses? You look like you sweat gravy and shower quarterly. Maybe.",
      "Eleven straight? That double chin's casting shadows on your triple chin.",
      "Twelve tails? You dress like a 1990s substitute teacher who gave up on life.",
      "Seven in a row? Your body shape is 'melted snowman' and your fashion is 'gave up.'",
      "Eight losses? Even Goodwill donates YOUR clothes to needier thrift stores.",
      "Nine straight? That bald spot's so shiny airlines use it for navigation.",
      "Ten in a row? You're shaped like a thumb with delusions of grandeur.",
      "Eleven losses? Your wallet's thinner than your excuses and that's REALLY thin.",
      "Twelve straight? You look like you clip coupons for Great Clips coupons.",
      "Seven tails? That beer belly's the only thing successful about your whole situation.",
      "Eight in a row? You're so cheap your toilet paper has ads printed on it.",
      "Nine losses? Your credit score and IQ are competing for last place.",
      "Ten straight? That receding hairline's retreating faster than Napoleon from Moscow.",
      "Eleven in a row? You dress like every divorced dad at every Little League game. Combined.",
      "Twelve losses? That gut's so big it needs its own gym membership. Which it won't use.",
      "Seven straight tails? Your barber charges you half price out of pity.",
      "Eight losses and going? Even your shadow's considering leaving you for someone thinner."
    ],
    "tier4": [
      "Fifteen losses? You're built like a question mark and your life's one big typo.",
      "Eighteen straight? That bald head shines brighter than your entire career path.",
      "Twenty tails? You're shaped like a traffic barrel and about as useful.",
      "Twenty-five in a row? Your wardrobe is 'clearance rack' and your life is 'fire sale.'",
      "Thirty losses? That gut's achieved things you haven't - like visibility.",
      "Thirteen straight? You look like you've been wearing the same outfit since Y2K.",
      "Sixteen in a row? Your body's shaped like melted ice cream left in a hot car.",
      "Nineteen losses? You're so bald eagles use your head to practice landing.",
      "Twenty-two straight? That beer gut's the only six-figure thing about you.",
      "Twenty-seven tails? You dress like every 'before' picture in every makeover show.",
      "Fourteen in a row? Your hairline started social distancing from your face in 2015.",
      "Seventeen losses? You're built like a poorly stacked snowman in April.",
      "Twenty straight? That double chin has more layers than your personality.",
      "Twenty-three in a row? Your fashion sense died and nobody planned a funeral.",
      "Twenty-eight losses? You look like you buy cologne by the gallon at Costco.",
      "Fifteen straight? That gut's so big it qualifies for its own stimulus check.",
      "Eighteen tails? Your wardrobe screams 'divorced dad at Applebee's.' Loudly.",
      "Twenty-one in a row? You're so cheap you return birthday gifts for store credit.",
      "Twenty-four straight? That bald spot's bigger than your retirement savings.",
      "Twenty-nine losses? You dress like a man who's given up on mirrors AND hope."
    ],
    "tier5": [
      "Thirty-one straight? You're not a degenerate, you're a DEGENGOD. All hail the bald king.",
      "Thirty-five losses? That gut's legendary. Your ambition? Not so much.",
      "Forty in a row? You're built like a bowling pin and life's been striking you down.",
      "Forty-five straight? That hairline's more distant than your relationship with vegetables.",
      "Fifty tails? This is transcendent. You've achieved enlightenment in failure.",
      "Thirty-two in a row? Your body shape is 'melted' and your life status is 'broken.'",
      "Thirty-seven straight? You look like you've been banned from every gym AND mirror.",
      "Forty-two losses? The meaning of life is watching you lose this magnificently.",
      "Forty-eight in a row? That gut's setting world records while you're setting new lows.",
      "Fifty-five straight? You're not mortal anymore. You're a monument to beautiful failure.",
      "Thirty-three losses? Holy trinity of losing. You're blessed by the patron saint of Ls.",
      "Thirty-nine in a row? Your bald head's so shiny pilots use it as a landmark.",
      "Forty-four straight? You dress like clearance rack had a clearance rack.",
      "Fifty-one tails? That beer belly's 80s. Your failure streak is timeless.",
      "Sixty losses? You've transcended humanity and become a living legend of losing.",
      "Thirty-four straight? You're shaped like a thumb and have the personality to match.",
      "Forty-one in a row? That receding hairline's running a marathon away from your face.",
      "Forty-seven losses? You look like you sweat ranch dressing.",
      "Fifty-three straight? This is the greatest achievement of failure in human history.",
      "Sixty-five tails? The simulation crashed trying to render this level of magnificent losing."
    ]
  }
}